src_ext/Documents/УЗ_НачислениеУченику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_НачислениеУченику</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_НачислениеУченику/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//новый документ — на текущее время, а не на полночь
	Если Объект.Ссылка.Пустая() И Объект.Дата = НачалоДня(Объект.Дата) Тогда
		Сейчас = НачалоМинуты(ТекущаяДатаСеанса());
		Объект.Дата = НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, Сейчас)) + (Сейчас - НачалоДня(Сейчас));
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;

	ОбновитьОстатокУченика();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УЗ_ДатыЗапрета.ФормаПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

//Остаток денег ученика по предмету в организации документа — та же функция, что в уроке, ПКО и перемещении
//(В12); без предмета — по всем предметам.
&НаСервере
Процедура ОбновитьОстатокУченика()

	ОстатокУченика = УЗ_Сервер.ОстатокДенегУченика(Объект.ФизЛицо, Объект.Организация,
		?(ЗначениеЗаполнено(Объект.ПредметОбучения), Объект.ПредметОбучения, Неопределено));

КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	ОбновитьОстатокУченика();
КонецПроцедуры

&НаКлиенте
Процедура ПредметОбученияПриИзменении(Элемент)
	ОбновитьОстатокУченика();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьОстатокУченика();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	ДанныеС = Новый Структура;
	ДанныеС.Вставить("Документ", Объект.Ссылка);
	ОткрытьФорму("Отчет.УЗ_ДвиженияДокумента.Форма.ДвиженияДокумента", ДанныеС, ЭтаФорма, , , , ,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
